Revit 2027 API
RoutingPreferenceManager.AddRule Method
Overload List
Name | Description
AddRule(RoutingPreferenceRuleGroupType, RoutingPreferenceRule) |  Adds a new routing preference rule to the rule group.
AddRule(RoutingPreferenceRuleGroupType, RoutingPreferenceRule, Int32) |  Adds a new routing preference rule to the specified position in the rule group.
Top
See Also
Reference
RoutingPreferenceManager Class
Autodesk.Revit.DB Namespace